{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.17.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "input_dim": 5
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 5,
            "activation": "softmax"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense_1/kernel", "shape": [5, 64], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [32, 5], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [5], "dtype": "float32"}
      ]
    }
  ]
}